[{"url": "https://www.gov.uk/settled-status-eu-citizens-families", "heading": "\n          Overview\n        ", "content": "If you’re an EU, EEA or Swiss citizen, you and your family can apply to the EU Settlement Scheme to continue living in the UK after 30 June 2021. If your application is successful, you’ll get either settled or pre-settled status.\n\nThe EEA includes the EU countries and also Iceland, Liechtenstein and Norway.\n\nYou may be able to stay in the UK without applying - for example, if you’re an Irish citizen or have indefinite leave to remain.\nSign up for email updates about the scheme.\nWhen you can apply\nThe EU Settlement Scheme is open. You can apply now if you meet the criteria.\nThe deadline for applying is 30 June 2021.\nWhich status you get may depend on when you apply.\nIf the UK leaves the EU without a deal\nYou will need to be living in the UK before it leaves the EU to apply. The deadline for applying will be 31 December 2020.\nFees\nIt’s free to apply to the scheme.\nIf you paid a fee when you applied to the EU Settlement Scheme, you’ll get a refund.\n\nThis guide is also available in 26 European languages.", "date": "2019-04-27"}, {"url": "https://www.gov.uk/settled-status-eu-citizens-families/eligibility", "heading": "\n          Who should apply\n        ", "content": "Except in a few cases, you need to apply if:\n\nyou’re an EU, EEA or Swiss citizen\nyou’re not an EU, EEA or Swiss citizen, but your family member is\n\n\nThe EEA includes the EU countries and also Iceland, Liechtenstein and Norway.\n\nThis means you need to apply even if you:\n\nwere born in the UK but are not a British citizen - you can check if you’re a British citizen if you’re not sure\nhave a UK ‘permanent residence document’\nare a family member of an EU, EEA or Swiss citizen who does not need to apply - including if they’re from Ireland\nare an EU, EEA or Swiss citizen with a British citizen family member\n\nWho else can apply\nYou may be able to apply if you’re not an EU, EEA or Swiss citizen but:\n\nyou used to have an EU, EEA or Swiss family member living in the UK (but you’ve separated, or they’ve died)\nyou’re the family member of a British citizen and you lived outside the UK in an EEA country together\nyou’re the family member of a British citizen who also has EU, EEA or Swiss citizenship and who lived in the UK as an EU, EEA or Swiss citizen before getting British citizenship\nyou’re the primary carer of a British, EU, EEA or Swiss citizen\nyou’re the child of an EU, EEA or Swiss citizen who used to live and work in the UK, or the child’s primary carer\n\nRead guidance on how to apply if you’re not an EU, EEA or Swiss citizen.\nWho does not need to apply\nYou do not need to apply if you have:\n\nindefinite leave to enter the UK\nindefinite leave to remain in the UK\nBritish or Irish citizenship (including ‘dual citizenship’)\n\nIf you’re an EU, EEA or Swiss citizen and you moved to the UK before it joined the EU\n\nYou only need to apply if you do not have indefinite leave to remain. \nIf you do have indefinite leave to remain, you’ll usually have a stamp in your passport or a letter from the Home Office saying this.\nIf you work in the UK but do not live here (‘frontier worker’)\nYou do not need to apply to the EU Settlement Scheme if you’re a ‘frontier worker’.\nRead the guidance for frontier workers to find out:\n\nwhether you qualify as a frontier worker\nwhat your rights will be\nwhat your family members need to do to stay in the UK\n\nIf you’re exempt from immigration control\nYou cannot apply to the EU Settlement Scheme. You do not need to do anything to continue living in the UK while you’re exempt from immigration control.\nYou’ll have been told if you’re exempt from immigration control, for example because you’re:\n\na foreign diplomat posted in the UK\na member of NATO\n\nIf you stop being exempt, for example if you change jobs, you will usually need to apply to the scheme within 90 days. You’ll be able to apply after the deadline of 30 June 2021, as long as you were living in the UK before 31 December 2020.", "date": "2019-04-27"}, {"url": "https://www.gov.uk/settled-status-eu-citizens-families/what-settled-and-presettled-status-means", "heading": "\n          What you’ll get\n        ", "content": "The rights and status of EU, EEA and Swiss citizens living in the UK will remain the same until 30 June 2021, if the UK leaves the EU with a deal.\n\nThe EEA includes the EU countries and also Iceland, Liechtenstein and Norway.\n\nIf you apply to the EU Settlement Scheme successfully, you’ll be able to continue living and working in the UK after 30 June 2021.\nYou’ll be given either:\n\nsettled status\npre-settled status\n\nYou will not be asked to choose which you’re applying for. Which status you get depends on how long you’ve been living in the UK when you apply. Your rights will be different depending on which status you get.\nSettled status\nYou’ll usually get settled status if you’ve:\n\nstarted living in the UK by 31 December 2020 (or by the date the UK leaves the EU without a deal)\nlived in the UK for a continuous 5-year period (known as ‘continuous residence’)\n\nFive years’ continuous residence means that for 5 years in a row you’ve been in the UK, the Channel Islands or the Isle of Man for at least 6 months in any 12 month period. The exceptions are:\n\none period of up to 12 months for an important reason (for example, childbirth, serious illness, study, vocational training or an overseas work posting)\ncompulsory military service of any length\ntime you spent abroad as a Crown servant, or as the family member of a Crown servant\ntime you spent abroad in the armed forces, or as the family member of someone in the armed forces\n\nYou can stay in the UK as long as you like if you get settled status. You’ll also be able to apply for British citizenship if you’re eligible.\nPre-settled status\nIf you do not have 5 years’ continuous residence when you apply, you’ll usually get pre-settled status. You must have started living in the UK by 31 December 2020 (or by the date the UK leaves the EU without a deal).\nYou can then apply to change this to settled status once you’ve got 5 years’ continuous residence.\nIf you’ll reach 5 years’ continuous residence at some point before 30 December 2020, you can choose to wait to apply until you reach 5 years’ continuous residence. This means that if your application is successful, you’ll get settled status without having to apply for pre-settled status first.\nYou can stay in the UK for a further 5 years from the date you get pre-settled status.\nYour rights with settled or pre-settled status\nYou’ll be able to:\n\nwork in the UK\nuse the NHS\nenrol in education or continue studying\naccess public funds such as benefits and pensions, if you’re eligible for them\ntravel in and out of the UK\n\nIf you want to spend time outside the UK\nIf you have settled status, you should be able to spend up to 5 years in a row outside the UK without losing your status. This is still subject to approval by Parliament.\n\nIf you’re a Swiss citizen you and your family members can spend up to 4 years in a row outside the UK without losing your settled status. This is still subject to approval by Parliament.\n\nIf you have pre-settled status, you can spend up to 2 years in a row outside the UK without losing your status. You will need to maintain your continuous residence if you want to qualify for settled status.\nIf you have children after applying\nIf you get settled status, any children born in the UK while you’re living here will automatically be British citizens.\nIf you get pre-settled status, any children born in the UK will be automatically eligible for pre-settled status. They will only be a British citizen if they qualify for it through their other parent.\nIf you want to bring family members to the UK\nYour close family members can join you in the UK before 31 December 2020. They’ll need to apply to the EU Settlement Scheme once they’re here.\nIf the UK leaves the EU with a deal you’ll be able to bring close family members to the UK after 31 December 2020 if both of the following apply:\n\nyour relationship with them began before 31 December 2020\nyou are still in the relationship when they apply to join you\n\nIf the UK leaves the EU without a deal the deadline for close family members joining you in the UK is 29 March 2022.\nYou’ll not be able to bring them here under the EU Settlement Scheme if your relationship with them began after 31 December 2020. They may be able to come here in a different way, for example on a family visa.", "date": "2019-04-27"}, {"url": "https://www.gov.uk/settled-status-eu-citizens-families/what-youll-need-to-apply", "heading": "\n          What you'll need to apply\n        ", "content": "When you apply, you’ll need proof of:\n\nyour identity\nyour residence in the UK, unless you have a valid permanent residence document, or valid indefinite leave to remain in or enter the UK\n\nProof of identity\nYou need a valid passport or national identity card. You also need to provide a digital photo of your face.\nIf you’re not an EU, EEA or Swiss citizen, you can use any of the following:\n\nvalid passport\nbiometric residence card\nbiometric residence permit\n\nIf you do not have any of these you may be able to use other evidence in certain situations. Contact the EU Settlement Resolution Centre if you do not have an identity document.\nWhen you apply, you can either:\n\nscan your document and upload your photo using the ‘EU Exit: ID Document Check’ app for Android\nsend your document in the post and upload your photo using the online application (you can take this yourself)\n\nScan your document\nYou can only use the ‘EU Exit: ID Document Check’ app for Android to scan your document if you have one of the following:\n\nvalid EU, EEA or Swiss passport or ID card, if its biometric\nUK-issued biometric residence card\n\nOtherwise you’ll need to send your documents by post.\nYou can use someone else’s Android phone to prove your identity. You can also visit one of the organisations offering to scan your document for you. You’ll need to book an appointment and you may have to pay a fee.\nThe ‘ID Document Check’ app will be available for iPhone by the end of 2019.\nSend your document by post\nYou must send your document by post if you have a:\n\nnon-EU or EEA passport\nbiometric residence permit\nnon-biometric ID card\n\nIf you have any other identity document, you can send it in the post if you cannot use the ‘ID Document Check’ app.\nYou’ll get your document back as soon as it has been scanned. This could be before you get your decision.\nProof of continuous residence\nTo be eligible for settled status, you usually need to have lived in the UK, the Channel Islands or the Isle of Man for at least 6 months in any 12 month period for 5 years in a row. You need to provide proof of this when you apply.\n\nIf you’ve not lived here for 5 years in a row you may still be eligible for pre-settled status.\n\nYou can give your National Insurance number to allow an automated check of your residence based on tax and certain benefit records.\nIf this check is successful, you’ll not need to provide any documents as proof of residence. You’ll only need to provide documents if you have been here for 5 years in a row but there is not enough data to confirm this.\nThe Home Office will tell you immediately after you apply if you need to provide any documents. You should submit photos or scans of your documents through the online application form, rather than sending them by post.\nRead what documents you can provide to the Home Office if you’re asked to provide more evidence.\nIf you have criminal convictions\nIf you’re 18 or over, the Home Office will check you have not committed serious or repeated crimes, and that you do not pose a security threat.\nYou’ll be asked to declare convictions that appear in your criminal record in the UK or overseas.\nYou do not need to declare any of the following:\n\nconvictions that do not need to be disclosed (‘spent convictions’)\nwarnings (‘cautions’)\nalternatives to prosecution, for example speeding fines\n\nYou’ll also be checked against the UK’s crime databases.\nYou’ll still be eligible for settled or pre-settled status if you’ve only been convicted of a minor crime.\nYou may still get settled or pre-settled status even if you have other convictions. This will be decided on a case-by-case basis.\nIf you’ve been to prison, you usually need 5 years’ continuous residence from the day you were released to be considered for settled status.\nIf you’re not an EU, EEA or Swiss citizen\nYou’ll usually need to provide proof of your relationship to your family member from the EU, EEA or Switzerland.\n\nThe EEA includes the EU countries and also Iceland, Liechtenstein and Norway.", "date": "2019-04-27"}, {"url": "https://www.gov.uk/settled-status-eu-citizens-families/applying-for-settled-status", "heading": "\n          Apply to the EU Settlement Scheme\n        ", "content": "The scheme is open - you can apply now if you’re eligible.\nYou can also choose to apply later depending on your circumstances.\nThe deadline for applying will be 30 June 2021, or 31 December 2020 if the UK leaves the EU without a deal.\nYou can apply using any device, for example, a laptop, Android device or iPhone.\nCheck what you’ll need before you apply.\nStart now\nThe Home Office will use the personal information you provide to decide whether to grant your application. Find out how the Home Office will process your personal information.\nContinue your application\nIf you’ve already started to apply, you can continue your application.\nWho cannot use this service\nYou cannot use the online service to apply to the scheme if you’re not an EU, EEA or Swiss citizen and you’re applying as:\n\nthe family member of a British citizen you lived with in Switzerland or an EU or EEA country that is not the UK\nthe family member of a British citizen who also has EU, EEA or Swiss citizenship and who lived in the UK as an EU, EEA or Swiss citizen before getting British citizenship\nthe primary carer of a British, EU, EEA or Swiss citizen\nthe child of an EU, EEA or Swiss citizen who used to live and work in the UK, and you’re in education - or you’re the child’s primary carer\n\nCall the EU Settlement Resolution Centre to find out how to apply. You’ll be asked a few questions over the phone before you’re sent the application form.\nFees\nIt’s free to apply to the scheme.\nIf you paid a fee when you applied to the EU Settlement Scheme, you’ll get a refund.\nGet help\nYou can get help with your application on the phone or online. The phone number is different if you’re from a local council or another organisation helping others to apply.\n\nIf you’re inside the UK \nTelephone: 0300 123 7379  \nMonday to Friday (excluding bank holidays), 8am to 8pm \nSaturday and Sunday, 9:30am to 4:30pm \nFind out about call charges\n\n\nIf you’re outside the UK \nTelephone: +44 (0)203 080 0010  \nMonday to Friday (excluding bank holidays), 8am to 8pm \nSaturday and Sunday, 9:30am to 4:30pm\n\n\nIf you’re from an organisation helping others to apply \nTelephone: 0300 790 0566 \nMonday to Friday (excluding bank holidays), 8am to 8pm \nSaturday and Sunday, 9:30am to 4:30pm \nFind out about call charges\n\nUse the EU Settlement Scheme contact form to get help online.\nYou can get support over the phone or in person if you need help doing things online.", "date": "2019-04-27"}, {"url": "https://www.gov.uk/settled-status-eu-citizens-families/not-EU-EEA-Swiss-citizen", "heading": "\n          If you're not an EU, EEA or Swiss citizen\n        ", "content": "You may be able to apply if:\n\nyou’re a family member of an EU, EEA or Swiss citizen\nyou’re the family member of a British citizen and you lived outside the UK in an EEA country together\nyou’re the family member of a British citizen who also has EU, EEA or Swiss citizenship and who lived in the UK as an EU, EEA or Swiss citizen before getting British citizenship\nyou used to have an EU, EEA or Swiss family member living in the UK\nyou’re the primary carer of a British, EU, EEA or Swiss citizen\nyou’re the child of an EU, EEA or Swiss citizen who used to live and work in the UK, or the child’s primary carer\n\n\nThe EEA includes the EU countries and also Iceland, Liechtenstein and Norway.\n\nIf you’re a family member of an EU, EEA or Swiss citizen\nYou can apply if you’re in a relationship with an EU, EEA or Swiss citizen as their spouse, civil partner or unmarried partner.\nYou can also apply if you’re related to an EU, EEA or Swiss citizen, their spouse or civil partner as their:\n\nchild, grandchild or great-grandchild under 21 years old\ndependent child over the age of 21\ndependent parent, grandparent or great-grandparent\ndependent relative\n\nYour EU, EEA or Swiss family member will usually need to apply as well.\nYou can apply if you’re the family member of an Irish citizen, even though they do not need to.\nIf you’re eligible because you’re the family member of an EU, EEA or Swiss citizen, you can apply using the online service.\nIf your family member is a British citizen (‘Surinder Singh’ applications)\nYou may be eligible if you lived outside the UK in an EU or EEA country (or Switzerland) with your family member, and you’re:\n\nmarried to or in a civil partnership with them\nunder 21 years old, and are their child or grandchild\n21 years or older, and are their dependent child or grandchild\ntheir dependent parent or grandparent\n\nThe country that you lived in together must have been your main residence. Your British family member must also have been working, studying or self-sufficient in the country while there.\nYou cannot use the online service to apply if this is how you qualify for the scheme.\nYou need to call the EU Settlement Resolution Centre to find out how to apply. You’ll be asked a few questions over the phone before you’re sent the application form.\nIf you used to have an EU, EEA or Swiss family member living in the UK\nYou may be able to apply if you used to have a family member living in the UK. This is called a ‘retained right of residence’.\nIf you’re eligible because you have retained rights of residence, you can apply using the online service.\nIf you’re in education in the UK\nYou can apply if you’re in education in the UK and one of the following is true:\n\nyou’re the child of an EU, EEA or Swiss citizen who has left the UK or died\none of your parents is the spouse or civil partner of an EU, EEA or Swiss citizen who has left the UK or died\none of your parents was previously the spouse or civil partner of an EU, EEA or Swiss citizen who has left the UK or died\n\nIf you qualify through any of these circumstances, your parent is also eligible, providing they have custody of you.\nIf your family member has died\nYou can also apply if your family member has died, and you lived continuously in the UK as their family member for at least one year immediately before their death.\nIf you were previously married or in a civil partnership\nYou can also apply if your marriage or civil partnership to an EU, EEA or Swiss citizen ended with a divorce, annulment or dissolution, and you lived in the UK when it ended.\nOne of the following must also apply:\n\nthe marriage or civil partnership lasted for at least 3 years and you’d both been living in the UK for at least one year during that time\nyou have custody of the EU, EEA or Swiss citizen’s child\nyou have been given right of access in the UK to the EU, EEA or Swiss citizen’s child - the child must be under 18\nyou have the right to live in the UK because you were the victim of domestic abuse in the marriage or civil partnership\n\nIf you’re the ‘primary carer’ of a British, EU, EEA or Swiss citizen\nYou may be able to apply if you’re the primary carer of a British, EU, EEA or Swiss citizen living in the UK. Any dependent children you have may also be able to apply.\nTo be someone’s primary carer, you must be both:\n\nresponsible for their day to day care, including making decisions about their education, health, and finances\na family member or their legal guardian\n\nYou can share these responsibilities with someone else.\nYou cannot use the online service to apply if this is how you qualify for the scheme.\nYou need to call the EU Settlement Resolution Centre to find out how to apply. You’ll be asked a few questions over the phone before you’re sent the application form.\nIf you’re the primary carer of an adult\nYou can apply if you’re the primary carer of a dependent adult who is a British citizen.\nIf you’re the primary carer of a child\nYou can apply if you’re the primary carer of a British child, or an EU, EEA or Swiss child who is financially independent.\nYou can also apply if you’re the primary carer of an EU, EEA or Swiss child who:\n\nis in education in the UK\nhas an EU, EEA or Swiss parent who has worked in the UK when the child has lived in the UK\nhas an EU, EEA or Swiss parent who has lived in the UK when the child has been in education\nhas an EU, EEA or Swiss parent who has stopped working in the UK, or left the UK\n\nWhat you’ll need to apply\nYou’ll need to provide proof of your relationship to your EU, EEA or Swiss citizen family member - for example, a birth, marriage or civil partnership certificate, or a residence card. You can scan and submit this through the online application form.\nIf you apply before your family member, you’ll also need to provide evidence of their identity and residence.\n\nYou do not need to provide any evidence if you have a valid ‘UK permanent residence document’.\n\nIf you do not have a biometric residence card, you’ll be asked to make an appointment at a UK Visa and Citizenship Application Services (UKVCAS) service point to provide your biometric information (your fingerprints and a photo, or a photo if you’re under 5) when you apply.\nWhen you need to provide more evidence\nIn some cases, you’ll also need to provide the same documents as you would for a residence card application.\nCheck which documents you’d provide for a residence card application if:\n\n\nyour family member is a British citizen and you lived together in an EU or EEA country that is not the UK, or in Switzerland - known as a ‘Surinder Singh’ application\n\nyour family member is both a British citizen and an EU, EEA or Swiss citizen, and lived in the UK as an EU, EEA or Swiss citizen before getting British citizenship\n\nyou used to have an EU, EEA or Swiss family member living in the UK - known as a ‘retained rights of residence’ application\nyou’re the primary carer of a British, EU, EEA or Swiss citizen\nyou’re the child of an EU, EEA or Swiss citizen who used to live and work in the UK, or their primary carer\n\nWhen to apply\nThe scheme is open now. The deadline for applying is 30 June 2021, except for in a few cases.\nYou’ll probably get a decision more quickly if you apply at the same time or after your family member applies.\nYour family member will be given an application number when they apply. You can use this to ‘link’ your application to theirs, so that your applications are considered together.\nIf you’re the primary carer of a British citizen\nYou can apply from 1 May 2019.\nIf you’re the family member of an EU, EEA or Swiss citizen who has died\nYou might be eligible for settled status before you’ve been living in the UK for 5 years.\nYour family member must have been working or self-employed in the UK, the Channel Islands or the Isle of Man at the time of their death. You must also have been living with them just before their death and either:\n\nthey lived continuously in the UK the Channel Islands or the Isle of Man for at least 2 years before their death\ntheir death was the result of an accident at work or an occupational disease\n\nIf you’re overseas and a family member of an EU, EEA or Swiss citizen living in the UK\nIf the UK leaves the EU with a deal and you’re not living in the UK by 31 December 2020, you’ll be able to apply to join your family member here after that date if all of the following apply:\n\nyour family member has either settled or pre-settled status\nyour relationship began before 31 December 2020\nyou remain a close family member, for example a spouse, civil partner, unmarried partner, a dependent child or grandchild, or a dependent parent or grandparent\n\nIf the UK leaves the EU without a deal the deadline for you to join your family member in the UK is 29 March 2022.", "date": "2019-04-27"}, {"url": "https://www.gov.uk/settled-status-eu-citizens-families/if-you-have-permanent-residence-or-indefinite-leave-to-remain", "heading": "\n          If you have permanent residence or indefinite leave to remain\n        ", "content": "The process of applying to the EU Settlement Scheme is different if you have a permanent residence document or indefinite leave to enter or remain.\nIf you have a valid ‘UK permanent residence document’\nIf you have a valid UK permanent residence document, you’ll have one of the following:\n\na certificate inside your blue ‘residence documentation’ booklet (or pink if you’re a Swiss national)\na certificate inside your passport\na biometric residence card confirming permanent residence (only if you’re not an EU, EEA or Swiss citizen)\n\nYour document is not a permanent residence document if it has ‘registration certificate’ written on it.\nIf you’re from the EU, EEA or Switzerland your permanent residence document will say ‘Document Certifying Permanent Residence’.\nIf you’re not an EU, EEA or Swiss citizen, your biometric residence card will say ‘Permanent Residence Status’.\n\nThe EEA includes the EU countries and also Iceland, Liechtenstein and Norway.\n\nWhat you must do\nTo continue living in the UK after 30 June 2021 you must either:\n\napply to the EU Settlement Scheme - you will not have to prove you have 5 years’ continuous residence\n\napply for citizenship before 30 June 2021 (or 31 December 2020 if the UK leaves the EU without a deal)\n\nIf you have indefinite leave to enter or remain\nIndefinite leave to enter or remain (ILR) are types of immigration status.\nYou’ll usually have applied for indefinite leave to enter or remain. You’ll have a stamp in your passport or a letter from the Home Office. You could also have a ‘vignette’ (sticker) or a biometric residence permit.\nYou can continue to live in the UK without applying to the EU Settlement Scheme if you have indefinite leave to enter or remain in the UK. However, if you choose to apply (and meet all the other conditions), you’ll get ‘indefinite leave to remain under the EU Settlement Scheme’ - also known as settled status.\nThis means you should be able to spend up to 5 years in a row outside the UK without losing your settled status (instead of 2 years with the indefinite leave to enter or remain you have now).\n\nHow long you can live outside the UK is still subject to approval by Parliament.\n\nYou will not have to prove you have 5 years’ continuous residence.\nIf you moved to the UK before it joined the EU on 1 January 1973\nYou may have been given ILR automatically if you’re an EU, EEA or Swiss citizen who lived in the UK before 1973. If you were, you will not need to apply to the EU Settlement Scheme to stay in the UK after June 2021.\nIf you do not have a document confirming your ILR status, you can either:\n\n\napply to the EU Settlement Scheme to get settled or pre-settled status\n\napply to the Windrush scheme to get proof of your ILR status\n\nIf you’re from Malta or Cyprus, you could also apply for British citizenship through the Windrush scheme.\nApplications for either scheme are free of charge.", "date": "2019-04-29"}, {"url": "https://www.gov.uk/settled-status-eu-citizens-families/apply-settled-status-for-child", "heading": "\n          If you're applying for your child\n        ", "content": "You can apply for settled or pre-settled status for your child if they’re under 21 and either:\n\nthey’re an EU, EEA or Swiss citizen\nthey are not an EU, EEA or Swiss citizen, but you are - or your spouse or civil partner is\n\n\nThe EEA includes the EU countries and also Iceland, Liechtenstein and Norway.\n\nYour child can also apply for themselves.\nIf you have applied to the EU Settlement Scheme\nYou’ll be able to ‘link’ your child’s application to yours, using the application number you got when you applied for yourself.\nYou can do this at any time after you’ve applied - you do not need to wait for a decision.\nYou can use your own email address in the application if your child does not have one.\nIf your own application is successful, your child will get the same status as you.\n\nYou will need to do this for each child you want to apply for.\n\nWhat proof you need\nYou’ll need to provide proof of your relationship to your child when you apply.\nYou will not need to provide proof of your child’s residence in the UK with their application. However the Home Office may ask you for proof of residence before making a decision.\nIf you have not applied to the EU Settlement Scheme\nIf you are eligible for the scheme, it may be easier to make your own application before you apply for your child.\nOtherwise you’ll need to provide proof that your child has 5 years’ continuous residence in the UK to be eligible for settled status - or your child will need to if they apply for themselves.\nIf they have not lived in the UK for a continuous 5-year period, they may be eligible for pre-settled status.\nIf you are not eligible for the scheme but your child is, for example, because they live in the UK and you do not, you can still apply for them. You’ll need to provide proof of their UK residence.\nIf you’re an Irish citizen\nYou do not need to apply for settled or pre-settled status if you’re an Irish citizen.\nHowever, if you’re an Irish citizen and your child is not a British citizen, they’ll be eligible for either:\n\nthe same status that you could get, based on how long you’ve lived in the UK\nsettled or pre-settled status, based on their own residence", "date": "2019-04-27"}, {"url": "https://www.gov.uk/settled-status-eu-citizens-families/settled-status-less-than-5-years", "heading": "\n          If you stop working or start work in another EU country\n        ", "content": "You and your family members can get settled status with less than 5 years’ continuous residence in certain situations.\nIf you have to stop working\nIf you’re an EU, EEA or Swiss citizen you may be able to get settled status if you have to stop working or being self-employed because of an accident or illness (known as ‘permanent incapacity’).\n\nThe EEA includes the EU countries and also Iceland, Liechtenstein and Norway.\n\nYou may be able to get settled status if either:\n\nyou have lived continuously in the UK for the 2 years immediately beforehand\nthe permanent incapacity was the result of an accident at work or an occupational disease that entitles you to a pension from a UK institution\n\nYou can also get settled status if you’re married to or in a civil partnership with a British citizen.\nIf you’re the family member of an EU, EEA or Swiss citizen at the time they stopped working you may also be eligible for settled status.\nIf you reach State Pension age or retire early\nIf you’re an EU, EEA or Swiss citizen you may be able to get settled status if you reach State Pension age or retire early.\nIf you’re the family member of an EU, EEA or Swiss citizen at the time they reach State Pension age or retire early you may also be eligible for settled status.\nIf you reach State Pension age\nIf you’re an EU, EEA or Swiss citizen, you can get settled status if you stopped working when you reached State Pension age and either:\n\nyou worked continuously or were self employed for 1 year beforehand and have lived continuously in the UK for 3 years\nyour spouse or civil partner is a British citizen\n\nIf you retire early\nIf you’re an EU, EEA or Swiss citizen you can get settled status if you retire early and either:\n\nyou worked continuously (for someone other than yourself) for 1 year beforehand and have lived continuously in the UK for 3 years\nyour spouse or civil partner is a British citizen\n\nIf you start work or self-employment in another EU country\nIf you’re an EU, EEA or Swiss citizen you can get settled status if you start work or self-employment in another EU country and you both:\n\nhave lived and worked or been self-employed in the UK continuously for 3 years  beforehand\nusually return to your UK home once a week\n\nIf you’re the family member of an EU, EEA or Swiss citizen at the time they start work or self-employment in another EU country you may also be eligible for settled status.", "date": "2019-04-27"}, {"url": "https://www.gov.uk/settled-status-eu-citizens-families/after-youve-applied", "heading": "\n          After you've applied\n        ", "content": "If your application is successful, you’ll be given either settled or pre-settled status. Find out what rights you get for each status.\nViewing and proving your status\nIf you successfully apply, the Home Office will email you a link to an online service that you can use to view and prove your status.\nYou will not get a physical document unless both of the following apply:\n\nyou’re from outside the EU, EEA or Switzerland\nyou do not already have a biometric residence card\n\n\nYou can read more information about how to view and prove your status.\n\nYou can still prove your rights in the UK until 31 December 2020 with your passport or national identity card (if you’re an EU, EEA or Swiss citizen), or with your biometric residence document.\n\nUpdating your details\nYou must keep your details up to date, for example if you get a new passport.\nApplying for citizenship\nYou’ll usually be able to apply for citizenship 12 months after you’ve got settled status.\nIf you paid for your application\nIf you paid the fee when you applied to the EU Settlement Scheme you’ll get a refund.\nIf the Home Office finds a mistake in your application\nThe Home Office will contact you before making a decision on your application, so you can correct the error.\nThey’ll also tell you if you need to provide more evidence before they can make a decision.\nIf your application is unsuccessful\nYou may be able to apply for an administrative review of the decision.\nYou cannot currently appeal the decision.\nYou can apply again at any time until 30 June 2021, or until 31 December 2020 if the UK leaves the EU without a deal.\nIf you already have an outstanding immigration application\nIn most cases, your outstanding immigration application will not be considered if you apply for the EU Settlement Scheme. You’ll get a refund for your outstanding application.\nContact UK Visas and Immigration (UKVI) to find out how your outstanding immigration application will be affected.\nMore detailed guidance is available.", "date": "2019-04-29"}]